ИнКар.Маркетплейсы/src/Enums/ТипыКонтактнойИнформации/ТипыКонтактнойИнформации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ТипыКонтактнойИнформации</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues>
    <name>Адрес</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>Телефон</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

ИнКар.Маркетплейсы/src/Catalogs/НаборыДополнительныхРеквизитовИСведений/НаборыДополнительныхРеквизитовИСведений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="0a136ad9-22ad-4ba7-a31a-40a193b49d26">
  <name>НаборыДополнительныхРеквизитовИСведений</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <hierarchical>Checked</hierarchical>
  </extension>
  <hierarchical>true</hierarchical>
  <tabularSections extendedConfigurationObject="b456d820-8034-4381-960d-66d9f86b0a4b">
    <name>ДополнительныеРеквизиты</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="bd55fd03-cf67-4333-a554-98e03d18f780">
      <name>Свойство</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ИнКар.Маркетплейсы/src/Catalogs/Склады/Склады.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>Склады</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <hierarchical>Checked</hierarchical>
  </extension>
  <hierarchical>true</hierarchical>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>Тип</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Представление</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>500</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Город</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>50</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ИнКар.Маркетплейсы/src/CommonModules/МП_ДопРеквизитыВызовСервераПовтИсп/Module.bsl
//
//	Филимонов И.В.
//		+7 913 240 81 77
//		
#Область ПрограммныйИнтерфейс

Функция ПубликуемыеДопРеквизиты() Экспорт

	// Считывание настроек из хранилища
	ИмяПодсистемы = Метаданные.Подсистемы.МП_Маркетплейсы.Имя;
	КлючНастроек = СтрШаблон("%1ПубликуемыеДопРеквизиты", ИмяПодсистемы);

	УстановитьПривилегированныйРежим(Истина);

	ПубликуемыеДопРеквизиты = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(ИмяПодсистемы,
																			   КлючНастроек,
																			   ,
																			   ,
																			   "ТрубинРВ");

	Если ПубликуемыеДопРеквизиты = Неопределено Тогда

		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Родитель",
								  Справочники.НаборыДополнительныхРеквизитовИСведений.НайтиПоНаименованию("Номенклатура",
																										  Истина));
		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
					   |	НаборыДополнительныхРеквизитовИСведенийДополнительныеРеквизиты.Свойство КАК Свойство,
					   |	НаборыДополнительныхРеквизитовИСведенийДополнительныеРеквизиты.Свойство.Имя КАК Имя
					   |ИЗ
					   |	Справочник.НаборыДополнительныхРеквизитовИСведений.ДополнительныеРеквизиты КАК
					   |		НаборыДополнительныхРеквизитовИСведенийДополнительныеРеквизиты
					   |ГДЕ
					   |	НаборыДополнительныхРеквизитовИСведенийДополнительныеРеквизиты.Ссылка В ИЕРАРХИИ (&Родитель)
					   |
					   |УПОРЯДОЧИТЬ ПО
					   |	Имя";

		ПубликуемыеДопРеквизиты = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Свойство");

		ОбщегоНазначения.ХранилищеОбщихНастроекСохранить(ИмяПодсистемы,
														 КлючНастроек,
														 ПубликуемыеДопРеквизиты,
														 ,
														 "ТрубинРВ");

	КонецЕсли;

	УстановитьПривилегированныйРежим(Ложь);

	Возврат ПубликуемыеДопРеквизиты;

КонецФункции

Функция КонтактныеДанныеСкладов() Экспорт

	Запрос = Новый Запрос;

	Запрос.Текст = "ВЫБРАТЬ
				   |	СкладыКонтактнаяИнформация.Тип КАК Тип,
				   |	СкладыКонтактнаяИнформация.Представление КАК Представление,
				   |	СкладыКонтактнаяИнформация.Ссылка КАК Склад,
				   |	СкладыКонтактнаяИнформация.Город
				   |ИЗ
				   |	Справочник.Склады.КонтактнаяИнформация КАК СкладыКонтактнаяИнформация
				   |ГДЕ
				   |	СкладыКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес)";

	КонтактныеДанныеСкладов = Запрос.Выполнить().Выгрузить();

	Возврат КонтактныеДанныеСкладов

КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти
